shoppe/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "test@test.com"]]
---
  def create
    # where login form POSTs to
    @user = User.find_by_email(params["user"]["email"])