shoppe/app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "email", "password_digest", "user_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.password = params[:password_plaintext]
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", 1], ["updated_at", "2016-01-20 03:18:50.560030"], ["id", 3]]
---
  def make_admin
    @user = User.find(params[:id])
    @user.update(user_type: 1)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "users" SET "user_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_type", 0], ["updated_at", "2016-01-20 03:20:29.034086"], ["id", 3]]
---
  def make_customer
    @user = User.find(params[:id])
    @user.update(user_type: 0)