app/controllers/items_controller.rb

  def index
    @items = Item.order(:created_at)
---
SELECT "items".* FROM "items"  ORDER BY "items"."created_at" ASC

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "price", "description", "quantity", "picture_url", "upc", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"