app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    p "params @create: email:#{params["email"]}, pwd:#{params["password_plaintext"]} "
    @user = User.find_by_email(params["email"])
    p "*" * 40
    p "A user #{User.first}"