app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "test@test.com"]]
---
  def create
    p "params @create: email:#{params["email"]}, pwd:#{params["password_plaintext"]} "
    @user = User.find_by_email(params["email"])