app/controllers/users_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 11], ["created_at", "2016-01-22 16:38:55.838361"], ["updated_at", "2016-01-22 16:38:55.838361"]]
---
  def create
    p "params @create: #{params.inspect} "
    @user = User.new(user_params)
    @user.password = params[:password_plaintext]
    p "-" * 40
    p @user
    p "-" * 40
    if @user.save
      Cart.create(user_id: @user.id)